---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BasepointEastwestParam
source: html/70cfd908-53b3-0415-b145-ed8baf50e40f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BasepointEastwestParam Property

"E/W"

## Syntax (C#)
```csharp
public static ForgeTypeId BasepointEastwestParam { get; }
```